s1/exercise-1.20-gcd-eval.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-17 Wed 15:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="LMG" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgda76a8f">1. Exercise context</a>
<ul>
<li><a href="#org902f776">1.1. Normal-order evaluation:</a>
<ul>
<li><a href="#orgc30a806">1.1.1. Normal-order evaluation, <code>if</code></a></li>
</ul>
</li>
<li><a href="#org376c02b">1.2. ?</a></li>
<li><a href="#orgea8d23c">1.3. Applicative-order evaluation:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgda76a8f" class="outline-2">
<h2 id="orgda76a8f"><span class="section-number-2">1.</span> Exercise context</h2>
<div class="outline-text-2" id="text-1">
<p>
In the Section 1.2.5 SICP discusses Greates Common Divisor and Euclid's
algorithm.
</p>

<p>
Exercise is to work through the normal-order and applicative-order evaluation.
</p>

<p>
Here the code:
</p>
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (gcd a b)
  (if (= b 0)
      a
      (gcd b (remainder a b))))
(gcd 24 18)
</pre>
</div>

<pre class="example">
6
</pre>
</div>


<div id="outline-container-org902f776" class="outline-3">
<h3 id="org902f776"><span class="section-number-3">1.1.</span> Normal-order evaluation:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-racket"><span class="linenr"> 1: </span>(gcd 206
<span class="linenr"> 2: </span>	 40)
<span class="linenr"> 3: </span>(if (= 40 0)
<span class="linenr"> 4: </span>    206
<span class="linenr"> 5: </span>    (gcd 40
<span class="linenr"> 6: </span>	 (remainder 206 40)))
<span class="linenr"> 7: </span>(gcd 40
<span class="linenr"> 8: </span>     (remainder 206 40))
<span class="linenr"> 9: </span>(if (= (remainder 206 40) 0)
<span class="linenr">10: </span>    40
<span class="linenr">11: </span>    (gcd (remainder 206 40)
<span class="linenr">12: </span>	 (remainder 40 (remainder 206 40))))
<span class="linenr">13: </span>;; +1
<span class="linenr">14: </span>(if (= 6 0)
<span class="linenr">15: </span>    40
<span class="linenr">16: </span>    (gcd (remainder 206 40)
<span class="linenr">17: </span>	 (remainder 40 (remainder 206 40))))
<span class="linenr">18: </span>
<span class="linenr">19: </span>(gcd (remainder 206 40)
<span class="linenr">20: </span>     (remainder 40 (remainder 206 40)))
<span class="linenr">21: </span>
<span class="linenr">22: </span>(if (= (remainder 40 (remainder 206 40)) 0)
<span class="linenr">23: </span>    (remainder 206 40)
<span class="linenr">24: </span>    (gcd (remainder 40 (remainder 206 40))
<span class="linenr">25: </span>	 (remainder (remainder 206 40)
<span class="linenr">26: </span>		    (remainder 40 (remainder 206 40)))))
<span class="linenr">27: </span>
<span class="linenr">28: </span>;; +2
<span class="linenr">29: </span>(if (= 4 0)
<span class="linenr">30: </span>    (remainder 206 40)
<span class="linenr">31: </span>    (gcd (remainder 40 (remainder 206 40))
<span class="linenr">32: </span>	 (remainder (remainder 206 40)
<span class="linenr">33: </span>		    (remainder 40 (remainder 206 40)))))
<span class="linenr">34: </span>
<span class="linenr">35: </span>(gcd (remainder 40 (remainder 206 40))
<span class="linenr">36: </span>     (remainder (remainder 206 40)
<span class="linenr">37: </span>		(remainder 40 (remainder 206 40))))
<span class="linenr">38: </span>(if (= (remainder (remainder 206 40)
<span class="linenr">39: </span>		  (remainder 40 (remainder 206 40)))
<span class="linenr">40: </span>       0)
<span class="linenr">41: </span>    (remainder 206 40)
<span class="linenr">42: </span>    (gcd (remainder (remainder 206 40)
<span class="linenr">43: </span>		    (remainder 40 (remainder 206 40)))
<span class="linenr">44: </span>	 (remainder (remainder 40 (remainder 206 40))
<span class="linenr">45: </span>		    (remainder (remainder 206 40)
<span class="linenr">46: </span>			       (remainder 40 (remainder 206 40))))))
<span class="linenr">47: </span>;; +4
<span class="linenr">48: </span>(if (= 2 0)
<span class="linenr">49: </span>    (remainder 206 40)
<span class="linenr">50: </span>    (gcd (remainder (remainder 206 40)
<span class="linenr">51: </span>		    (remainder 40 (remainder 206 40)))
<span class="linenr">52: </span>	 (remainder (remainder 40 (remainder 206 40))
<span class="linenr">53: </span>		    (remainder (remainder 206 40)
<span class="linenr">54: </span>			       (remainder 40 (remainder 206 40))))))
<span class="linenr">55: </span>
<span class="linenr">56: </span>(gcd (remainder (remainder 206 40)
<span class="linenr">57: </span>		(remainder 40 (remainder 206 40)))
<span class="linenr">58: </span>     (remainder (remainder 40 (remainder 206 40))
<span class="linenr">59: </span>		(remainder (remainder 206 40)
<span class="linenr">60: </span>			   (remainder 40 (remainder 206 40)))))
<span class="linenr">61: </span>(if (= (remainder (remainder 40 (remainder 206 40))
<span class="linenr">62: </span>		  (remainder (remainder 206 40)
<span class="linenr">63: </span>			     (remainder 40 (remainder 206 40))))
<span class="linenr">64: </span>       0)
<span class="linenr">65: </span>    (remainder (remainder 206 40)
<span class="linenr">66: </span>	       (remainder 40 (remainder 206 40)))
<span class="linenr">67: </span>    )
<span class="linenr">68: </span>;; +7
<span class="linenr">69: </span>(if (= 0 0)
<span class="linenr">70: </span>    (remainder (remainder 206 40)
<span class="linenr">71: </span>	       (remainder 40 (remainder 206 40)))
<span class="linenr">72: </span>    (...))
<span class="linenr">73: </span>(remainder (remainder 206 40)
<span class="linenr">74: </span>	   (remainder 40 (remainder 206 40)))
<span class="linenr">75: </span>;; +2
<span class="linenr">76: </span>(remainder 6
<span class="linenr">77: </span>	   (remainder 40 6))
<span class="linenr">78: </span>;; +1
<span class="linenr">79: </span>(remainder 6 4)
<span class="linenr">80: </span>;; +1
<span class="linenr">81: </span>;; =&gt; 2
<span class="linenr">82: </span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp
(remainder 206
	   40)
(remainder 40
	   (remainder 206 40))
(remainder (remainder 206 40)
	   (remainder 40 (remainder 206 40)))
(remainder (remainder 40
		      (remainder 206 40))
	   (remainder (remainder 206 40) (remainder 40 (remainder 206 40))))
</pre>
</div>

<pre class="example">
6
4
2
0
</pre>


<p>
So the number of calls to <code>remainder</code> is 18:
</p>
<div class="org-src-container">
<pre class="src src-racket">(+ 1 2 4 7 2 1 1)
</pre>
</div>

<pre class="example">
18
</pre>
</div>

<div id="outline-container-orgc30a806" class="outline-4">
<h4 id="orgc30a806"><span class="section-number-4">1.1.1.</span> Normal-order evaluation, <code>if</code></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
I'm not sure how the special form <code>if</code> is considered in normal-order evaluation.
</p>

<p>
p.16 says "would not evaluate the operands until their values were needed". Arguably, <code>if</code> is one such case.
</p>

<p>
p.21,Ex1.5 points that one can assume that the evaluation rule for the special form <code>if</code> does not depend on order of evaluation: the predicate exp is evaluated first and the result determines whether to evaluate the conseuqent or the alternative expression.
</p>
</div>
</div>
</div>

<div id="outline-container-org376c02b" class="outline-3">
<h3 id="org376c02b"><span class="section-number-3">1.2.</span> ?</h3>
</div>

<div id="outline-container-orgea8d23c" class="outline-3">
<h3 id="orgea8d23c"><span class="section-number-3">1.3.</span> Applicative-order evaluation:</h3>
<div class="outline-text-3" id="text-1-3">
<pre class="example">
(gcd 206 40)
(gcd 40 (remainder 206 40))
(gcd 40 6)
(gcd 6 (remainder 40 6))
(gcd 6 4)
(gcd 4 (remainder 6 4))
(gcd 4 2)
(gcd 2 (remainder 4 2))
(gcd 2 0)
=&gt; 2
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LMG</p>
<p class="date">Created: 2023-05-17 Wed 15:33</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
